code/openfoam/tutorials/incompressibleFluid/simpleRushtonMRF/system/createBafflesDict.baffles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      createBafflesDict.baffles;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    bafflesGroup // group name
    {
        type        faceZone;
        zoneName    baffles;

        owner
        {
            name        baffles;
            type        wall;
        }
        neighbour
        {
            $owner;
        }
    }
}


// ************************************************************************* //
